Repository: ivarhuni/playtime
Catalog: lib/presentation/core/localization/intl_*.arb
Languages: is

# app_name
source: LoveAssistant
is: Hjálp í ást

# global_cancel
source: Cancel
is: Hætta við

# global_confirm
source: Confirm
is: Staðfesta

# global_more
source: More
is: Meira

# global_done
source: Done
is: Búið

# global_enter_custom
source: Enter custom value
is: Þín eigin

# global_pick_date
source: Pick a date
is: Veldu dagsetningu

# global_optional
source: Optional
is: Valkvæmt

# global_required
source: Required
is: Nauðsynlegt

# global_generic_field_error
source: This entry is invalid
is: Þetta atriði þarf að vera útfyllt

# date_format_month_and_day
source: MMMM dd
is: dd. MMMM

# wizard_title
source: Partner setup
is: Uppsetning

# settings_pick_language
source: Select language
is: Veldu tungumál

# wizard_greetings
source: ✨ Your Personal Love-Assistant
is: ✨ Þinn eigin Ástar Engill

# wizard_greetings_message_1
source: Hi, I’m here to help you nurture your relationship with your loved one.
is: Hæ, ég er hér til að hjálpa þér að rækta sambandið þitt.

# wizard_greetings_message_2
source: I’ll remind you of special dates, craft personalized messages, and suggest thoughtful ideas.
is: Ég get minnt þig á mikilvægar dagsetningar, samið skilaboð og stungið upp á góðum hugmyndum.

# wizard_start
source: Begin
is: Byrjum

# wizard_next
source: Next
is: Næsta

# wizard_previous
source: Previous
is: Fyrri

# wizard_partner_profile_title
source: Tell Me About Your Partner
is: Byrjum á grunnatriðunum

# wizard_partner_profile_message_1
source: We’ll start with the basics — like their name, pronouns, and important dates.
is: Byrjum á grunnatriðum eins og nafni og mikilvægum dagsetningum.

# wizard_partner_profile_message_initial_1
source: We’ll start with the basics; name and gender.
is: Segðu mér hvað þín heittelskaða persónu heitir og hvers kyns hún er.

# wizard_partner_profile_message_2
source: This helps me personalize reminders and messages just for them.
is: Þá get ég skipulagt sérstök tilefni og sérsniðið skilaboð betur.

# wizard_partner_profile_name_title
source: What’s your partner’s name?
is: Hvað heitir sérstaka persónan þín?

# wizard_partner_profile_name_hint
source: Partner name
is: Nafn félaga þíns

# wizard_partner_profile_name_missing
source: Name is required
is: Nafn er nauðsynlegt

# wizard_partner_pronouns_title
source: How should I refer to your partner?
is: Hvernig á að ávarpa félaga þinn?

# wizard_partner_profile_pronoun_missing
source: Pronoun is required
is: Fornafn er nauðsynlegt

# wizard_partner_pronouns_hint
source: Select your partner’s pronouns
is: Veldu fornafn

# wizard_partner_birthday_title
source: When is your partner’s birthday?
is: Hvenær á félagi þinn afmæli?

# wizard_partner_profile_birthday_missing
source: Birthday is required
is: Afmæli er nauðsynlegt

# wizard_partner_birthday_hint
source: Pick birthday date
is: Veldu afmælisdagsetningu

# wizard_partner_birthday_explanation
source: I use your partner’s birthday to make sure you have enough time to plan something special for your loved one.
is: Ég nota þessar upplýsingar til að ganga úr skugga um að þú hafir tíma til að skipuleggja eitthvað sérstakt fyrir þína sérstöku persónu.

# wizard_partner_anniversary_title
source: Do you have an anniversary date?
is: Einhver stór dagsetning?

# wizard_partner_anniversary_hint
source: Pick your big date
is: Gifting, trúlofun osfr.

# wizard_partner_anniversary_skip_title
source: Skip anniversary?
is: Sleppa stórviðburði?

# wizard_partner_anniversary_skip_message
source: Are you sure you want to skip the anniversary date?
is: Ertu viss um að þú viljir sleppa dagsetningu stórviðurðar (gifting, trúlofun osfr.)?

# wizard_partner_anniversary_skip_yes_confirm
source: Yes, skip
is: Já, sleppa

# wizard_partner_anniversary_skip_no_cancel
source: No
is: Nei

# wizard_partner_anniversary_explanation
source: I use your anniversary date to make sure you have enough time to plan or get something special for your loved one.
is: Ég nota þessar upplýsingar til að ganga úr skugga um að þú hafir tíma til að skipuleggja og fá eitthvað sérstakt fyrir þína sérstökupersónu.

# wizard_partner_loves_title
source: What does {gender} like?
is: Hvað elskar {gender}?

# wizard_partner_loves_message_1
source: Share the things your partner loves to help me craft personalized experiences.
is: Segðu mér fá því sem félagi þinn elskar svo ég geti skapað betri upplifun.

# wizard_partner_loves_message_initial_1
source: Tell me about {gender} love languages and preferred tone of voice so I can create messages that hit the mark.
is: Segðu mér frá ástar-tungumálinu sem passar {gender} og talsmáta svo ég geti samið skilaboð sem hitta beint í mark.

# wizard_partner_loves_message_2
source: This ensures that my suggestions and messages are truly meaningful.
is: Með þessu móti get ég búið til tillögur og skilaboð sem hitta betur í mark.

# wizard_partner_love_language_explanation
source: There are said to be five forms of expressions of love. Quality Time: Spending undivided, meaningful time together. Words of Affirmation: Expressing love and appreciation through kind and affirming words. Acts of Service: Showing love by doing helpful or thoughtful tasks. Physical Touch: Expressing love through physical gestures like hugs, kisses, and other forms of touch. Receiving Gifts: Giving and receiving thoughtful gifts as a symbol of love.
is: Það er oft talað um að það séu fimm tegundir ástar-tjáningar. Gæðatími: Að eyða óskiptum, innihaldsríkum tíma saman. Staðfestingarorð: Að tjá ást og þakklæti með góðum og staðfestandi orðum. Þjónusta: Að sýna kærleika með því að vinna gagnleg eða ígrunduð verkefni. Líkamleg snerting: Að tjá ást með líkamlegum táknum eins og knúsum, kossum og öðrum snertingum. Gefa gjafir: Að gefa og þiggja ígrundaðar gjafir sem tákn um ást.

# wizard_partner_hobbies_explanation
source: Sharing your loved one’s hobbies will help me select a variety of appropriate activities and gifts.
is: Með því að deila með mér áhugamálum félaga þíns hjálpar þú mér að velja viðeigandi viðburði og gjafir.

# wizard_partner_foods_explanation
source: Sharing your loved one’s favorite foods will help me select the correct food gifts and restaurant suggestons.
is: Með því að deila hvaða mat þín heittelskaða persóna finnst góður hjálpar þú mér að velja réttar matargjafir og veitingastaði.

# wizard_partner_tone_of_voice_explanation
source: Selecting the correct tone of voice helps me craft messages that resonate with your loved one better.
is: Með því að velja talsmáta hjálpar þú mér að semja skilaboð sem hljóma betur í eyrum félaga þíns.

# wizard_partner_tone_of_voice_title
source: What tone of voice fits {gender} best?
is: Hvernig talsmáti á best við {gender}?

# wizard_partner_tone_of_voice_hint
source: Select tone of voice
is: Veldu talsmáta

# wizard_partner_love_language_title
source: Which love languages match {gender}?
is: Hvernig ástarmál passar {gender}?

# wizard_partner_hobbies_title
source: Does {gender} have any hobbies?
is: Hefur {gender} einhver áhugamál?

# wizard_partner_food_and_gifts_title
source: Tell me a bit more about {gender} tastes
is: Segðu mér aðeins frá {gender} smekk

# wizard_partner_food_and_gifts_message_1
source: Please share with me {gender} gift and food preferences.
is: Segðu mér frá matar og gjafastíl sem á best við {gender}.

# wizard_partner_food_and_gifts_message_2
source: This ensures I recommend things {name} loves and can avoid what {gender} may not like as much.
is: Þá get ég stungið upp á hlutum sem {name} mun dýrka og forðast þá sem {gender} kýs síður.

# global_pronoun_she_her
source: She
is: Hún

# global_pronoun_he_him
source: He
is: Hann

# global_pronoun_they_them
source: They
is: Hán

# global_pronoun_custom
source: Custom
is: Velja sjálf(ur)

# global_love_language_receiving_gifts
source: Receiving gifts
is: Að fá gjafir

# global_love_language_acts_of_service
source: Acts of service
is: Þjónusta

# global_love_language_quality_time
source: Quality time
is: Tími saman

# global_love_language_words_of_affirmation
source: Words of affirmation
is: Falleg orð

# global_love_language_physical_touch
source: Physical touch
is: Líkamleg snerting

# global_pronoun_she_nefnifall
source: She
is: Hún

# global_pronoun_she_tholfall
source: Her
is: Hana

# global_pronoun_she_thagufall
source: Her
is: Henni

# global_pronoun_she_eignarfall
source: Hers
is: Hennar

# global_pronoun_he_nefnifall
source: He
is: Hann

# global_pronoun_he_tholfall
source: Him
is: Hann

# global_pronoun_he_thagufall
source: Him
is: Honum

# global_pronoun_he_eignarfall
source: His
is: Hans

# global_pronoun_they_nefnifall
source: They
is: Hán

# global_pronoun_they_tholfall
source: Them
is: Hán

# global_pronoun_they_thagufall
source: Them
is: Háni

# global_pronoun_they_eignarfall
source: Theirs
is: Háns

# global_pronoun_invalid_nefnifall
source: Them
is: Þau

# global_pronoun_invalid_tholfall
source: They
is: Þau

# global_pronoun_invalid_thagufall
source: Them
is: Þeim

# global_pronoun_invalid_eignarfall
source: Theirs
is: Þeirra

# global_tone_of_voice_playful
source: Playful
is: Hnyttinn

# global_tone_of_voice_romantic
source: Romantic
is: Rómantískur

# global_tone_of_voice_casual
source: Casual
is: Hversdagslegur

# global_tone_of_voice_formal
source: Formal
is: Formlegur

# global_hobby_reading
source: Reading
is: Lestur og bækur

# global_hobby_cooking
source: Cooking
is: Eldamennska

# global_hobby_traveling
source: Traveling
is: Ferðalög

# global_hobby_gaming
source: Gaming
is: Tölvuleikir

# global_hobby_fitness
source: Fitness
is: Heilsa

# global_hobby_music
source: Music
is: Tónlist

# global_hobby_crafting
source: Crafting
is: Föndur

# global_hobby_gardening
source: Gardening
is: Garðyrkja

# global_hobby_movies_and_tv
source: Movies & TV
is: Myndir og sjónvarp

# global_hobby_fishing_and_hunting
source: Fishing and hunting
is: Veiðar

# global_hobby_sports
source: Sports
is: Íþróttir og sport
